valentinbellini/FRDM-KL43Z/Sistemas Digitales II/TrabajosPracticos/MKL43Z_SD2_TP2_ACELEROMETRO/source/main.c

#include <stdio.h>
#include "board.h"
#include "fsl_debug_console.h"
#include "clock_config.h"
#include "fsl_smc.h"

#include "Drivers/PowerMode/power_mode_switch.h"
#include "Drivers/Board/SD2_board.h"
#include "Drivers/Key/key.h"
#include "Drivers/I2C/SD2_I2C.h"
#include "Drivers/time.h"
#include <App/mef.h>

void init_clocks_and_power_mode(){
	uint32_t freq = 0;
	smc_power_state_t currentPowerState;

	PRINTF("\r\n####################  TRABAJO PRACTICO 2 - SD2 ####################\n\r\n");

	currentPowerState = SMC_GetPowerModeState(SMC);
	APP_ShowPowerMode(currentPowerState);
	PRINTF("    Clock luego del Reset\n");
	freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
	PRINTF("    Core Clock = %dMHz \r\r", freq/1000000);


	PRINTF("    Configurando Clocks a máxima frecuencia...\n");
	/* Se configuran los clocks a máxima frecuencia */
    BOARD_InitBootClocks();
    /* Se habilita la posibilidad de operar con todos los modos de bajo consumo */
    SMC_SetPowerModeProtection(SMC, kSMC_AllowPowerModeAll);
    freq = CLOCK_GetFreq(kCLOCK_CoreSysClk);
    PRINTF("    Core Clock = %dMHz \r\r", freq/1000000);

    PRINTF("\r\n#################### ========================= ####################\n\r\n");
}

int main(void) {

	/* Inicialización de clocks a máxima frecuencia y micro en modo RUN a 48MHz */
	init_clocks_and_power_mode();

    /* Init FSL debug console. */
    BOARD_InitDebugConsole();

    /* Se inicializa funciones de la placa */
    board_init();

    /* Inicialización del I2C */
    SD2_I2C_init();

    /* Se inicializa la MEF de pulsadores*/
    key_init();

    /* Inicialización del timMeasure con PIT */
	time_init();

    /* Se configura interrupción de systick */
    SysTick_Config(SystemCoreClock / 1000U);

    /* Inicialización de la MEF del programa --> VLPR*/
    mef_init();

    while(1) {
    	mef();
    }

    return 0;
}

void SysTick_Handler(void){
    key_periodicTask1ms();
    mef_task1ms();
}
